rottenpotatoes/app/controllers/movies_controller.rb

  def similar
  if(params[:director].nil?)
     title = Movie.find(params[:id]).title
    flash[:notice] = "'#{title}'hasd no director info"
     redirect_to movies_path()
  else
   @movies = Movie.where(director:params[:director])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'